# M.A.D. Python Libraries - `pandas`

<span style="color:red;">**M.A.D.** => **M**achine **L**earning and **D**ata Science<span>

**Purpose:** The purpose of this workbook is to help you get comfortable with the topics outlined below.

**Prereqs**
* Numpy Workbook or a working knowledge of numpy

**Recomended Usage**
* Run each of the cells (Shift+Enter) and edit them as necessary to solidify your understanding
* Do any of the exercises that are relevant to helping you understand the material

**Topics Covered**
* Pandas

# Workbook Setup

## Troubleshooting Tips

If you run into issues running any of the code in this notebook, check your version of Jupyter, Python, extensions, libraries, etc.

```bash
!jupyter --version

jupyter core     : 4.6.1
jupyter-notebook : 6.0.2
qtconsole        : not installed
ipython          : 7.9.0
ipykernel        : 5.1.3
jupyter client   : 5.3.4
jupyter lab      : 1.2.3
nbconvert        : 5.6.1
ipywidgets       : not installed
nbformat         : 4.4.0
traitlets        : 4.3.3
```

```bash
!jupyter-labextension list

JupyterLab v1.2.3
Known labextensions:
   app dir: /usr/local/share/jupyter/lab
        @aquirdturtle/collapsible_headings v0.5.0  enabled  OK
        @jupyter-widgets/jupyterlab-manager v1.1.0  enabled  OK
        @jupyterlab/git v0.8.2  enabled  OK
        @jupyterlab/github v1.0.1  enabled  OK
        jupyterlab-flake8 v0.4.0  enabled  OK

Uninstalled core extensions:
    @jupyterlab/github
    jupyterlab-flake8
```

In [6]:
# # Run this cell to check the version of Jupyter you are running
# !jupyter --version

In [2]:
# # Run one of these cells to check what extensions you are using
# !jupyter-labextension list
# !jupyter-nbextension list

In [1]:
# # Check ipython version
# import sys
# print(sys.version)

## Notebook Configs

In [3]:
# AUTO GENERATED CELL FOR NOTEBOOK SETUP

# NOTEBOOK WIDE MAGICS

# Reload all modules before executing a new line
%load_ext autoreload
%autoreload 2

# Abide by PEP8 code style
%load_ext pycodestyle_magic
%pycodestyle_on

# LIBRARY SPECIFIC MAGICS - UNCOMMENT AS NEEDED

# Plot all matplotlib plots in output cell and save on close
# %matplotlib inline

In [4]:
import pandas as pd

import numpy as np  # just to show pandas compatability with np
import seaborn as sns  # just for getting some sample datasets

# [`pandas`](https://pandas.pydata.org/pandas-docs/stable/)

`pandas` is a library that comes with many easy-to-use data structures and data analysis tools.

[Pandas Cheatsheet (pdf)](https://assets.datacamp.com/blog_assets/PandasPythonForDataScience.pdf)

[Pandas Docs](https://pandas.pydata.org/pandas-docs/stable/)

## Pandas Vocabulary

Like most libraries, Pandas has some custom vocabulary that we need to understand in order to use it properly. 

* **Rows** in Pandas may be referred to as a **row** or an **index**

Many functions allow `axis` as an argument with the default usually being `axis=0`. This tells Pandas whether you want the function to be performed on the rows or columns.

* **Axis 0** will act on all the ROWS in each COLUMN (axis=0 is the same a saying axis='index')
* **Axis 1** will act on all the COLUMNS in each ROW (axis=1 is the same as saying axis='columns')

## Create Pandas Data Structures

There are two data structure classes we typically work with in Pandas, Series and DataFrames. Though actually a DataFrame is just a collection of Series.

```python
pd.Series()
pd.DataFrame()
```

### Create a Series

A 1D indexed array that can hold any data type; use when you have 1D data

In [4]:
# Series with integer data
s1 = pd.Series([1, 2, 3, 4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
a = np.array(['a', 'b', 'c'])

s2 = pd.Series(a)
s2

0    a
1    b
2    c
dtype: object

We can also customize the indices if we want

In [6]:
# Series with cusom indicies
s4 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s4

a    0
b    1
c    2
d    3
dtype: int64

In [7]:
# Series from a dictionary
dict = {'a': 0,
        'b': [1, 2, 3],
        'c': 2}

s5 = pd.Series(dict)
s5

a            0
b    [1, 2, 3]
c            2
dtype: object

### Create a Dataframe

A 2D labeled data structure with columns of potentially different types; a collection of Series data structures

In [8]:
# DataFrame from Python list
df1 = pd.DataFrame([0, 10, 20, 30, 40])
df1

    0
0   0
1  10
2  20
3  30
4  40

In [9]:
# Dataframe with different types and lengths
df2 = pd.DataFrame([3, ['a', 'b', 'c']])
df2

           0
0          3
1  [a, b, c]

In [5]:
# Explicitly name the columns
data = [['a', 12], ['b', 20], ['c', 40], ['d', 33], ['e', 88]]

df3 = pd.DataFrame(data, columns=['letters', 'numbers'], dtype=float)
df3

  letters  numbers
0       a     12.0
1       b     20.0
2       c     40.0
3       d     33.0
4       e     88.0

We can actually see as discussed before each column in the DataFrame is just a Series

In [8]:
series_letters = df3.letters
series_number = df3.numbers

print(type(df3))
print(type(series_letters))
print(type(series_number))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [11]:
# Create a df using the dictionary
data = {'Country': ['Haiti', 'Canada', 'England'],
        'Capital': ['Port-au-Prince', 'Montreal', 'London'],
        'Population': [100000, 200000, 300000]}

df4 = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df4

   Country         Capital  Population
0    Haiti  Port-au-Prince      100000
1   Canada        Montreal      200000
2  England          London      300000

In [12]:
# Define index & column later
df5 = pd.DataFrame([[1, 2, 3],
                    [4, 5, 6],
                    [7, 8, 9]],
                   index=[1, 2, 3],
                   columns=['a', 'b', 'c'])
df5

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [118]:
df6 = pd.DataFrame(np.arange(12).reshape(3, 4),
                   columns=['A', 'B', 'C', 'D'])
df6

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

## Inspecting DataFrames and Series

```python
df.head()
df.tail()
df.sample()

df.shape
df.info
df.columns
df.index()
df.count()
```

We are going to take a look at some sample datasets from a Python graphing library that is make to work with pandas data structures

In [184]:
diamonds_df = sns.load_dataset('diamonds')

In [14]:
# Checkout the beginning of the data
diamonds_df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [15]:
# Checkout the end of the data
diamonds_df.tail()

       carat        cut color clarity  depth  table  price     x     y     z
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

You can run both `head` and `tail` with an integer (ex. `df.head(3)`) telling it how many rows to print out. The default is 5

In [16]:
# Checkout a random sample of 3 rows from the dataframe
diamonds_df.sample(3)

       carat      cut color clarity  depth  table  price     x     y     z
47991   0.32  Premium     J      IF   61.2   59.0    533  4.41  4.44  2.71
36222   0.36    Ideal     D     VS2   60.0   56.0    933  4.68  4.66  2.80
38332   0.32    Ideal     E    VVS1   61.3   57.0   1020  4.43  4.38  2.70

In [17]:
# Return rows by columns
diamonds_df.shape

(53940, 10)

In [18]:
# Return index range
diamonds_df.index

RangeIndex(start=0, stop=53940, step=1)

In [19]:
# Describe df cols
diamonds_df.columns

Index(['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price', 'x', 'y',
       'z'],
      dtype='object')

In [20]:
# Return count of non-NA values
diamonds_df.count()

carat      53940
cut        53940
color      53940
clarity    53940
depth      53940
table      53940
price      53940
x          53940
y          53940
z          53940
dtype: int64

## I/O

```python
pd.read_csv()
df.to_csv()

pd.read_excel()
df.to_excel()
```

### Read and Write to CSV

In [ ]:
df1

In [ ]:
df.to_csv('myDataFrame.csv')

In [ ]:
pd.read_csv('myDataFrame.csv', header=None, nrows=5)

### Read and Write to Excel

In [ ]:
df1.to_excel('myDataFrame.xlsx', sheet_name='Sheet1')

In [ ]:
pd.read_excel('myDataFrame.xlsx')

## Selection and Assignment

```python
s[1]
df[4:]

df.iloc[]
df.loc[]

df.iat[]
df.at[]
```

We can index DataFrames and Series using bracket notation just like Python lists.

In [21]:
# Select one element from series
s2[1]

'b'

In [55]:
s2[1] = 'v'
s2

0    a
1    v
2    c
dtype: object

In [62]:
# Select from row 2 to end
df1[2:]

    0
2  20
3  30
4  40

In [93]:
s1

0    1
1    2
2    3
3    4
dtype: int64

In [94]:
# Select where value is not >3
s1[~(s1 > 3)]

0    1
1    2
2    3
dtype: int64

In [96]:
# Select where values <2 or >3
s1[(s1 < 2) | (s1 > 3)]

0    1
3    4
dtype: int64

In [99]:
# Select where df 'numbers' col are > 50
df3[df3['numbers'] > 50]

  letters  numbers
4       e     88.0

In [102]:
# Select as above but assign new val
df3[df3['numbers'] > 50] = ['s', 100]
df3

  letters  numbers
0       a      0.0
1       a      0.0
2       a      0.0
3       d     33.0
4       s    100.0

In [58]:
df3

  letters  numbers
0       a     12.0
1       b     20.0
2       c     40.0
3       d     33.0
4       e     88.0

In [59]:
# Select via INDEX - row 0, col 1
df3.iloc[[0], [1]]

   numbers
0     12.0

In [63]:
# Select via INDEX - row begin to 2, col 1 and assign the vals 0
df3.iloc[:3, 1] = 0
df3

  letters  numbers
0       a      0.0
1       b      0.0
2       c      0.0
3       d     33.0
4       e     88.0

In [64]:
# Select via INDEX - row 1, all cols
df3.iloc[[1], :]

  letters  numbers
1       b      0.0

In [45]:
# WILL NOT WORK - use loc instead
# df3.iloc[[0], ['numbers']]

This cell above will **NOT WORK** if you run it because 'numbers' is NOT AN INDEX, its a label. To do this we need to use `loc`, not `iloc`

In [68]:
# Select via LABEL - row 3, col 'numbers'
df3.loc[[3], ['numbers']]

   numbers
3     33.0

In [67]:
# Select row indices 1-3, col 'letters' 
df3.loc[df3.index[1:3], 'letters'] = 'a'
df3

  letters  numbers
0       a      0.0
1       a      0.0
2       a      0.0
3       d     33.0
4       e     88.0

In [72]:
df3.loc[1:3, ['letters', 'numbers']]

  letters  numbers
1       a      0.0
2       a      0.0
3       d     33.0

We can also use the faster `iat` and `at` instead of the very similar `iloc` and `loc`. The downside to using `at` and `iat` however is that you can't use arrays as indices (you must use scalars) like you can using `loc` and `iloc`.

In [81]:
df3.iat[0, 1]

0.0

In [83]:
# WILL NOT WORK - can't use arrays as indices
# df3.iat[0, :]

In [92]:
df3.at[3, 'letters']

'd'

In [90]:
# If iat only takes indices, why does this work?
df3.iat[0, df3.columns.get_loc('letters')]

'a'

## Handling Missing Data (replacing, dropping) and Duplicates

```python
df.drop()
df.drop_duplicates()

df.replace()
df.fillna()
```

In [110]:
s2

0    a
1    v
2    c
dtype: object

In [128]:
# Drop 1 on axis 0 (rows)
s = s2.drop(1, axis=0)
s

0    a
2    c
dtype: object

In [119]:
df6

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [123]:
# Drop 1 along axis 0 (rows)
df6.drop(1, axis=0)

   A  B   C   D
0  0  1   2   3
2  8  9  10  11

In [125]:
# Drop B and D along axis 1 (columns)
df6.drop(['B', 'D'], axis=1)

   A   C
0  0   2
1  4   6
2  8  10

We can see df3 has some duplicate rows. We can get rid of them

In [234]:
df3

  letters  numbers
0       a      0.0
1       a      0.0
2       a      0.0
3       d     33.0
4       s    100.0

In [235]:
df3.drop_duplicates()

  letters  numbers
0       a      0.0
3       d     33.0
4       s    100.0

We can also replace and fill in Na values with 0 or some other value.

In [237]:
df3

  letters  numbers
0       a      0.0
1       a      0.0
2       a      0.0
3       d     33.0
4       s    100.0

In [238]:
df3.replace('a', 'd')

  letters  numbers
0       d      0.0
1       d      0.0
2       d      0.0
3       d     33.0
4       s    100.0

In [239]:
# Create some data with NaN vals
s = s1 + s3
s

a    14.0
b     NaN
c     1.0
d     NaN
dtype: float64

In [242]:
# Fill all np.na values with 0
s.fillna(0)

a    14.0
b     0.0
c     1.0
d     0.0
dtype: float64

## Applying Functions

```python
df.apply(my_funct)
df.applymap(my_funct)
```

In [135]:
df6

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

We can apply a function element-wise to a DataFrame

In [137]:
# Apply function element-wise
df6.applymap(lambda x: x*2)

    A   B   C   D
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22

We can also apply a function to a specific subset of data in a DataFrame.

In [163]:
df6

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [160]:
# Apply function to each row (axis=0)
df = df6.apply(np.sum, axis=0)
df

A    12
B    15
C    18
D    21
dtype: int64

In [162]:
# Apply function to each col (axis=1)
df = df6.apply(np.sum, axis=1)
df

0     6
1    22
2    38
dtype: int64

## Sort and Rank

```python
df.sort_index()
df.sort_values()
df.rank()
```

In [168]:
df4

   Country         Capital  Population
0    Haiti  Port-au-Prince      100000
1   Canada        Montreal      200000
2  England          London      300000

In [173]:
# Sort by LABELS (along an axis).
df4.sort_index(axis=1)

          Capital  Country  Population
0  Port-au-Prince    Haiti      100000
1        Montreal   Canada      200000
2          London  England      300000

In [175]:
# Sort by VALUES (along an axis)
df4.sort_values(by='Country')

   Country         Capital  Population
1   Canada        Montreal      200000
2  England          London      300000
0    Haiti  Port-au-Prince      100000

In [179]:
df3

  letters  numbers
0       a      0.0
1       a      0.0
2       a      0.0
3       d     33.0
4       s    100.0

In [182]:
# Compute numerical data ranks (1 through n) along axis
df3.rank(axis=0, method='max')

   letters  numbers
0      3.0      3.0
1      3.0      3.0
2      3.0      3.0
3      4.0      4.0
4      5.0      5.0

## Aggregate Functions

```python
df.describe() # show all summary statistics

df.sum()
df.cumsum()

df.min()
df.max()

df.idxmin()
df.idxmax()

df.mean()
df.median()
```

Describe is one of my favorite methods because it gives you a lot of summary stats side by side without you having to do much.

In [187]:
# Show summary stats for the diamonds df dataset
diamonds_df.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

We can also do each of these individually or using specific criteria. Lets look at a smaller df that we can computer in our head so we can see exactly what the functions are doing.

In [200]:
df6

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [192]:
# Sum along B
df6['B'].sum()

15

In [201]:
df6.cumsum(axis='index')

    A   B   C   D
0   0   1   2   3
1   4   6   8  10
2  12  15  18  21

In [202]:
df6.cumsum(axis='columns')

   A   B   C   D
0  0   1   3   6
1  4   9  15  22
2  8  17  27  38

In [203]:
# Min along axis=0 (default axis is always 0 or 'index')
df6.min()

A    0
B    1
C    2
D    3
dtype: int64

In [205]:
df6.max(axis=1)

0     3
1     7
2    11
dtype: int64

In [207]:
# Min id val
df6.idxmin()

A    0
B    0
C    0
D    0
dtype: int64

In [208]:
# Max id val
df6.idxmax()

A    2
B    2
C    2
D    2
dtype: int64

In [209]:
# Mean along axis
df6.mean()

A    4.0
B    5.0
C    6.0
D    7.0
dtype: float64

In [210]:
# Median along axis
df6.median()

A    4.0
B    5.0
C    6.0
D    7.0
dtype: float64

## Arithmetic Operations with Fill Methods

```python
s.add()
s.sub()
s.div()
s.mul()
```

In [224]:
s1 = pd.Series([7, -2, 3], index=['a', 'b', 'c'])
s1

a    7
b   -2
c    3
dtype: int64

In [225]:
s3 = pd.Series([7, -2, 3], index=['a', 'c', 'd'])
s3

a    7
c   -2
d    3
dtype: int64

We can add these datasets

In [226]:
s1 + s3

a    14.0
b     NaN
c     1.0
d     NaN
dtype: float64

You can see it will add where the indices line up. We can also add with a fill value so we don't get NaNs where indices don't match.

In [227]:
s1.add(s3, fill_value=0)

a    14.0
b    -2.0
c     1.0
d     3.0
dtype: float64

We can do the same with subtraction, division, etc.

In [229]:
s1.sub(s3, fill_value=2)

a    0.0
b   -4.0
c    5.0
d   -1.0
dtype: float64

In [230]:
s1.div(s3, fill_value=4)

a    1.000000
b   -0.500000
c   -1.500000
d    1.333333
dtype: float64

In [231]:
s1.mul(s3, fill_value=3)

a    49.0
b    -6.0
c    -6.0
d     9.0
dtype: float64

# Exercises

We all know we don't really learn anything until we have to struggle through doing it :D 

Roll up your sleeves and dive in.

### Inspect the following dataset

* Look at 10 random sample rows
* Look at the beginning/end of the dataset
* Calculate the std, mean, etc.

### Clean up this dataset

* Replace all missing values with pd.na
* ...

### Create a DataFrame that looks like this

```python
    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN
```

### Create a DataFrame that looks like this

```python
     A    B
0  2.0  1.0
1  3.0  NaN
2  1.0  0.0
```

### Create a new DataFrame using the titanic dataset that consists of just low class males under 30

# Answers

Many of the exercises will have several correct answers. I tried to pick the fastest and most memory efficient answers but if you think you have a better one 1) prove it using the `%timeit` magic then 2) let me know!